using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Anda.Fluid.Drive.DeviceType
{
    public enum DiType
    {
        对刀仪 = 0,
        气压检测 = 1, 
        轨道通信 = 2,
        U轴限位 = 3,
        胶阀温度检测 = 4,
        胶量感应2 = 5,
        胶量感应1 = 6,
        门禁 = 7,
        急停 = 8,
        光纤 = 9,

        阀1温度报警 = 10,
        阀2温度报警 = 11,

        进板检测 = 12,
        定位1检测 = 13,
        定位2检测 = 14,
        出板检测 = 15,
        前设备放板信号 = 16,
        后设备求板信号 = 17,

        //AD19
        排风检测 = 18,
        双阀切换气缸1 = 19,
        双阀切换气缸2 = 20,
        阀1左倾斜 = 21,
        阀1右倾斜 = 22,
        阀1前倾斜 = 23,
        阀1后倾斜 = 24,

        //IJET7 单阀双轨
        轨道1右到左定位2检测 = 25,
        轨道2右到左定位2检测 = 26,

        //轨道2
        轨道2进板检测 = 27,
        轨道2定位1检测 = 28,
        轨道2定位2检测 = 29,
        轨道2出板检测 = 30,
        轨道2前设备放板信号 = 31,
        轨道2后设备求板信号 = 32,

        //滑台气缸
        滑台气缸下限位 = 33,
        滑台气缸上限位 = 34,

        //RTV
        启动 = 35,
        停止 = 36,
        下层轨道进板检测 = 37,
        下层轨道出板检测 = 38,
        前上门门禁 = 39,
        后上门门禁 = 40,
        前下门门禁 = 41,
        下层轨道放板信号 = 42,
        下层轨道求板信号 = 43,
        压板下位 = 44,
        压板上位 = 45,
        测高下位 = 46,
        测高上位 = 47,
        待料阻挡下位 = 48,
        待料阻挡上位 = 49,
        涂胶挡板下位 = 50,
        涂胶挡板上位 = 51,

        // TSV-300
        暂停 = 52,
    }

}
