using System;
using System.Collections.Generic;
using System.Linq;
using System.Text;
using System.Threading.Tasks;

namespace Anda.Fluid.Drive.DeviceType
{
    public enum DoType
    {
        飞测 = 1,
        飞拍 = 2,
        OUT3 = 3,
        OUT4 = 4,
        离子风棒1 = 5,
        离子风棒2 = 6,
        轨道通信 = 7,
        环形光 = 8,
        同轴光 = 9,
        红色信号灯 = 10,
        黄色信号灯 = 11,
        绿色信号灯 = 12,
        蜂鸣器 = 13,

        //胶枪加热1和胶枪加热2此处名称最好不要改动，因为温控器层无法引用此层，但温控器又需要控制IO，
        //所以无法使用此枚举来获取Do，使用了string来获取Do，若这里进行了改动，温控器控制IO的功能将失效。
        胶枪加热2 = 14,
        胶枪加热1 = 15,

        真空清洗 = 16,

        求板信号 = 17,
        放板信号 = 18,
        运输反转 = 19,
        运输正转 = 20,
        OUT21 = 21,
        OUT22 = 22,
        预热开 = 23,
        预热阻挡 = 24,
        预热顶升 = 25,
        预热吹气 = 26,
        工作阻挡 = 27,
        工作顶升 = 28,
        工作吹气 = 29,
        出板阻挡 = 30,
        出板顶升 = 31,
        出板吹气 = 32,

        //iJet6
        链条减速 = 33,
        胶枪一胶阀 = 34,
        胶枪一气阀 = 35,

        //AD19
        红灯闪亮 = 36,
        黄灯闪亮 = 37,
        绿灯闪亮 = 38,
        蓝灯闪亮 = 39,
        排风电机 = 40,
        主气压电磁阀 = 41,
        阀1胶桶气压控制 = 42,
        阀2胶桶气压控制 = 43,
        机械测高气动 = 44,

        //擦纸带
        擦纸带 = 45,

        //IJET7 单阀双轨
        轨道1右到左工作阻挡 = 46,
        轨道2右到左工作阻挡 = 47,

        //双轨
        轨道2求板信号 = 48,
        轨道2放板信号 = 49,
        轨道2运输反转 = 50,
        轨道2运输正转 = 51,
        轨道2预热阻挡 = 52,
        轨道2预热顶升 = 53,
        轨道2预热吹气 = 54,
        轨道2工作阻挡 = 55,
        轨道2工作顶升 = 56,
        轨道2工作吹气 = 57,
        轨道2出板阻挡 = 58,
        轨道2出板顶升 = 59,
        轨道2出板吹气 = 60,

        //四方位
        滑台气缸升降 = 61,

        //RTV
        测高阀,
        上层轨道调宽刹车 = 62,
        下层轨道调宽刹车 = 63,
        下层轨道求板信号 = 64,
        下层轨道有板信号 = 65,


    }
}
